tutorial/programmer-0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-05 Fri 12:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutorial #0: Hi, Relic!</title>
<meta name="author" content="Connor Fynn Redfern" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../doc-style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Tutorial #0: Hi, Relic!</h1>
<p>
Prev <a href="../index.html">Up</a> <a href="programmer-1.html">Next</a>
</p>
<div id="outline-container-orgff1047f" class="outline-2">
<h2 id="orgff1047f">IMPORTANT</h2>
<div class="outline-text-2" id="text-orgff1047f">
<p>
At current, this tutorial is very much a work in progress. For a much better
introduction to the basics of relic, it is recommended you chedkout the readme
of the <a href="https://github.com/rationalis-petra/pico">pico compiler</a>. 
</p>
</div>
</div>
<div id="outline-container-orgedabe93" class="outline-2">
<h2 id="orgedabe93">About this Tutorial</h2>
<div class="outline-text-2" id="text-orgedabe93">
<p>
This tutorial is intended to be an introduction to the for developers who have
already programmed in at least one standard "popular" language such as python,
C/C++, Java etc. No prior experience is assumed with the many "weird" languages
Relic draws from (lisp, forth, prolog etc.).
</p>
</div>
</div>
<div id="outline-container-org7215031" class="outline-2">
<h2 id="org7215031">Getting Started</h2>
<div class="outline-text-2" id="text-org7215031">
<p>
Relic is powered by Pico, the Relic compiler. It is available for Windows and
Linux as an AMD64 executable. To install, download the <a href="https://github.com/rationalis-petra/pico/releases/latest">latest release</a>, unzip the
archive, navigate to your operating system's folder, and execute the appropriate
installer.
</p>

<p>
Once installed, you can start the compiler by running either <code>relic</code> or <code>pico</code>
from the command line. For general assistance, run <code>relic help</code> to see available
commands and options. 
</p>
</div>
</div>
<div id="outline-container-org9516ea9" class="outline-2">
<h2 id="org9516ea9">Diving into the REPL</h2>
<div class="outline-text-2" id="text-org9516ea9">
<p>
This tutorial begins with the REPL, Relic's Read-Eval-Print Loop environment.
Launch the REPL by running <code>relic repl</code> from the command line. For an enhanced
experience, add the <code>-i</code> flag to run in interactive mode: <code>relic repl -i</code>,
although be aware that this is currently experimental and you may encounter bugs.
Inside the REPL, you can evaluate Relic expressions line by line. Let's start
with some simple arithmetic. If you type <code>(+ 11 7)</code> and hit Enter, you should
see the following.
</p>

<div class="org-src-container">
<pre class="src src-relic">user &gt; (+ <span style="color: #0D9C94;">11</span> <span style="color: #0D9C94;">7</span>)
<span style="color: #0D9C94;">18</span>
</pre>
</div>

<p>
This is because Relic will evaluate the 
</p>

<p>
After running, you will now see "Hello, World!" printed on a new line,
followed by the term <code>:unit</code>. This is because after running, the <code>write-line</code>
function returns the value <code>:unit</code>, which the repl then prints to the command
line. Nice!
</p>

<p>
Relic uses a unique syntax for function calls. Instead of the standard
<code>add(2, 3)</code>, functions in Relic are written as <code>(add 2 3)</code>. This prefix style
even applies to operators. For example, instead of <code>2 + 3</code>, you would write
<code>(+ 2 3)</code>. While this syntax may seem unusual initially, it integrates
seamlessly with Relic's advanced features like metaprogramming, which we'll
explore later.
</p>

<p>
With this knowledge in hand, we can try evaluating some other expressions, e.g. 
</p>

<div class="org-src-container">
<pre class="src src-relic">(* <span style="color: #0D9C94;">2</span> <span style="color: #0D9C94;">3</span>)
(- <span style="color: #0D9C94;">3</span> (* <span style="color: #0D9C94;">4</span> <span style="color: #0D9C94;">5</span>))
(&lt; <span style="color: #0D9C94;">2</span> <span style="color: #0D9C94;">3</span>)
</pre>
</div>

<p>
Try some of your own!
</p>
</div>
<div id="outline-container-org4c10f20" class="outline-3">
<h3 id="org4c10f20">Defining Values and Writing Functions</h3>
<div class="outline-text-3" id="text-org4c10f20">
<p>
Relic uses the `def` term to define values. For example:
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> x <span style="color: #0D9C94;">10</span>)  <span style="color: #454459;">;; </span><span style="color: #454459;">Defines x as 10.</span>
</pre>
</div>

<p>
You can also use `proc` to define functions. Functions in Relic take arguments
and return results. For instance: 
</p>

<div class="org-src-container">
<pre class="src src-relic">(<span style="color: #9d81ba;">def</span> add-one
  (<span style="color: #9d81ba;">proc</span> [(x <span style="color: #62D2DB;">I64</span>)]
    (+ x <span style="color: #0D9C94;">1</span>)))
</pre>
</div>

<p>
Here, we define a function called `add-one` that increments a number by one.
</p>
</div>
</div>
</div>
<div id="outline-container-org054f0b8" class="outline-2">
<h2 id="org054f0b8">Writing Your First Program</h2>
<div class="outline-text-2" id="text-org054f0b8">
<p>
Now, let's put everything together to write a simple program:
</p>

<div class="org-src-container">
<pre class="src src-relic"><span style="color: #454459;">;; </span><span style="color: #454459;">Define a main function
</span>(<span style="color: #9d81ba;">def</span> main
  (<span style="color: #9d81ba;">proc</span> []
    (write-line <span style="color: #f5c791;">"Hello, World!"</span>)))

<span style="color: #454459;">;; </span><span style="color: #454459;">Call the main function to execute
</span>(main)
</pre>
</div>

<p>
Save this program in a file called `hello-world.rl` and run it with the Relic
compiler:
</p>

<div class="org-src-container">
<pre class="src src-bash">relic hello-world.rl
</pre>
</div>

<p>
This will print:
</p>

<pre class="example" id="org336ceb3">
Hello, World!
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Connor Fynn Redfern</p>
<p class="date">Created: 2026-06-05 Fri 12:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
